export enum StarName {
  紫微 = '紫微',
  天机 = '天机',
  太阳 = '太阳',
  武曲 = '武曲',
  天同 = '天同',
  廉贞 = '廉贞',
  天府 = '天府',
  太阴 = '太阴',
  贪狼 = '贪狼',
  巨门 = '巨门',
  天相 = '天相',
  天梁 = '天梁',
  七杀 = '七杀',
  破军 = '破军',
  左辅 = '左辅',
  右弼 = '右弼',
  文昌 = '文昌',
  文曲 = '文曲',
  天魁 = '天魁',
  天铖 = '天铖',
  禄存 = '禄存',
  擎羊 = '擎羊',
  陀罗 = '陀罗',
  天马 = '天马',
  火星 = '火星',
  铃星 = '铃星',
  地空 = '地空',
  地劫 = '地劫',
  红鸾 = '红鸾',
  天喜 = '天喜',
  天姚 = '天姚',
  咸池 = '咸池',
  天刑 = '天刑',
}

export enum StarCategory {
  /// 北斗
  N = 'N',
  /// 南斗
  S = 'S',
  /// 吉星
  Benefic = 'Benefic',
  /// 凶星
  Malefics = 'Malefics',
  /// 天禄、天马
  Money = 'Money',
  /// 普通星
  Common = 'Common',
}

export enum Vstar {
  禄 = '禄',
  权 = '权',
  科 = '科',
  忌 = '忌',
}

export enum Power {
  庙 = '庙',
  旺 = '旺',
  得 = '得',
  利 = '利',
  平 = '平',
  不 = '不',
  陷 = '陷',
}
